{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "GameEventSystemSettings",
			"Children": [
				{
					"Source":
					{
						"Text": "Configure logging settings for the Game Event System plugin"
					},
					"Translation":
					{
						"Text": "为游戏事件系统插件配置日志设置"
					},
					"Key": "SectionDescription"
				},
				{
					"Source":
					{
						"Text": "Game Event System"
					},
					"Translation":
					{
						"Text": "游戏事件系统"
					},
					"Key": "SectionText"
				}
			]
		},
		{
			"Namespace": "K2Node",
			"Children": [
				{
					"Source":
					{
						"Text": "Add Data Type Pin"
					},
					"Translation":
					{
						"Text": "添加数据类型引脚"
					},
					"Key": "AddDataTypePin"
				},
				{
					"Source":
					{
						"Text": "Add Listener"
					},
					"Translation":
					{
						"Text": "添加监听器"
					},
					"Key": "AddListener_Title"
				},
				{
					"Source":
					{
						"Text": "Add a listener to the game event system. 【{0}】"
					},
					"Translation":
					{
						"Text": "向游戏事件系统添加监听器。【{0}】"
					},
					"Key": "AddListener_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Adds a Data Type pin to specify the delegate parameter type"
					},
					"Translation":
					{
						"Text": "添加数据类型引脚以指定委托参数类型"
					},
					"Key": "AddDataTypePinTooltip"
				},
				{
					"Source":
					{
						"Text": "Binding type: Function name or Delegate"
					},
					"Translation":
					{
						"Text": "绑定类型：函数名或委托"
					},
					"Key": "AddListener_BindType_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Check if the specified event exists in the game event system. [{0}]"
					},
					"Translation":
					{
						"Text": "检查指定事件是否在游戏事件系统中存在。[{0}]"
					},
					"Key": "HasEvent_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Delegate node is invalid, please recreate! @@"
					},
					"Translation":
					{
						"Text": "委托节点无效，请重新创建！@@"
					},
					"Key": "AddListener_DelegateInvalid"
				},
				{
					"Source":
					{
						"Text": "Delegate to bind"
					},
					"Translation":
					{
						"Text": "要绑定的委托"
					},
					"Key": "AddListener_Delegate_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event Exists"
					},
					"Translation":
					{
						"Text": "事件存在"
					},
					"Key": "HasEvent_ReturnValue"
				},
				{
					"Source":
					{
						"Text": "Event ID type: String or GameplayTag"
					},
					"Translation":
					{
						"Text": "事件ID类型：字符串或游戏标签"
					},
					"Key": "GetEventListenerCount_EventIdType_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event ID type: String or GameplayTag"
					},
					"Translation":
					{
						"Text": "事件ID类型：字符串或GameplayTag"
					},
					"Key": "AddListener_EventIdType_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to check"
					},
					"Translation":
					{
						"Text": "要检查的事件名称"
					},
					"Key": "GetEventListenerCount_EventTag_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to check"
					},
					"Translation":
					{
						"Text": "要检查的事件名称"
					},
					"Key": "GetEventListenerCount_EventString_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to register"
					},
					"Translation":
					{
						"Text": "要注册的事件名称"
					},
					"Key": "AddListener_EventString_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Event name to register"
					},
					"Translation":
					{
						"Text": "要注册的事件名称"
					},
					"Key": "AddListener_EventTag_Tooltip"
				},
				{
					"Source":
					{
						"Text": "GameEventSystem"
					},
					"Translation":
					{
						"Text": "游戏事件系统"
					},
					"Key": "GameEventCategory"
				},
				{
					"Source":
					{
						"Text": "Get the number of listeners for the specified event. [{0}]"
					},
					"Translation":
					{
						"Text": "获取指定事件的监听器数量。[{0}]"
					},
					"Key": "GetEventListenerCount_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Has Even"
					},
					"Translation":
					{
						"Text": "检查事件存在"
					},
					"Key": "HasEvent_Title"
				},
				{
					"Source":
					{
						"Text": "Invalid pins in @@"
					},
					"Translation":
					{
						"Text": "@@中的引脚无效"
					},
					"Key": "InvalidPins"
				},
				{
					"Source":
					{
						"Text": "Listener Count"
					},
					"Translation":
					{
						"Text": "监听器数量"
					},
					"Key": "GetEventListenerCount_ReturnValue"
				},
				{
					"Source":
					{
						"Text": "Number of listeners for this event"
					},
					"Translation":
					{
						"Text": "此事件的监听器数量"
					},
					"Key": "GetEventListenerCount_ReturnValue_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Receiver object to remove all listeners from"
					},
					"Translation":
					{
						"Text": "要移除所有监听器的接收者对象"
					},
					"Key": "RemoveAllListeners_Receiver_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Remove All Listeners For Receiver"
					},
					"Translation":
					{
						"Text": "移除接收者的所有监听器"
					},
					"Key": "RemoveAllListenersForReceiver_Title"
				},
				{
					"Source":
					{
						"Text": "Remove Last Data Type Pin"
					},
					"Translation":
					{
						"Text": "移除数据类型引脚"
					},
					"Key": "RemoveDataTypePin"
				},
				{
					"Source":
					{
						"Text": "Remove Listener"
					},
					"Translation":
					{
						"Text": "移除监听器"
					},
					"Key": "RemoveListener_Title"
				},
				{
					"Source":
					{
						"Text": "Remove all event listeners registered by the specified receiver object. [{0}]"
					},
					"Translation":
					{
						"Text": "移除指定接收者对象注册的所有事件监听器。[{0}]"
					},
					"Key": "RemoveAllListenersForReceiver_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Remove listener from game event system. 【{0}】"
					},
					"Translation":
					{
						"Text": "从游戏事件系统移除监听器。【{0}】"
					},
					"Key": "RemoveListener_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Removes the last Data Type pin"
					},
					"Translation":
					{
						"Text": "移除数据类型引脚"
					},
					"Key": "RemoveDataTypePinTooltip"
				},
				{
					"Source":
					{
						"Text": "Send Event"
					},
					"Translation":
					{
						"Text": "发送事件"
					},
					"Key": "SendEvent_Title"
				},
				{
					"Source":
					{
						"Text": "Sends an event to the game event system. 【{0}】"
					},
					"Translation":
					{
						"Text": "向游戏事件系统发送事件。【{0}】"
					},
					"Key": "SendEvent_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "接收者"
					},
					"Key": "RemoveAllListenersForReceiver_Receiver"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "目标"
					},
					"Key": "AddListener_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "目标"
					},
					"Key": "GetEventListenerCount_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "目标"
					},
					"Key": "HasEvent_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "目标"
					},
					"Key": "RemoveListener_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "目标"
					},
					"Key": "SendEvent_Self"
				},
				{
					"Source":
					{
						"Text": "Target"
					},
					"Translation":
					{
						"Text": "目标"
					},
					"Key": "UnpinEvent_Self"
				},
				{
					"Source":
					{
						"Text": "Target object for listening"
					},
					"Translation":
					{
						"Text": "用于监听的目标对象"
					},
					"Key": "AddListener_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target object for removing event"
					},
					"Translation":
					{
						"Text": "用于移除事件的目标对象"
					},
					"Key": "RemoveListener_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target object for sending event"
					},
					"Translation":
					{
						"Text": "用于发送事件的目标对象"
					},
					"Key": "SendEvent_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Target object's function name"
					},
					"Translation":
					{
						"Text": "目标对象的函数名"
					},
					"Key": "AddListener_FunctionName_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Unpin Event"
					},
					"Translation":
					{
						"Text": "取消固定事件"
					},
					"Key": "UnpinEvent_Title"
				},
				{
					"Source":
					{
						"Text": "Unpin the specified event and clear pinned data. [{0}]"
					},
					"Translation":
					{
						"Text": "取消固定指定事件并清除固定数据。[{0}]"
					},
					"Key": "UnpinEvent_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Whether the event exists"
					},
					"Translation":
					{
						"Text": "事件是否存在"
					},
					"Key": "HasEvent_ReturnValue_Tooltip"
				},
				{
					"Source":
					{
						"Text": "World context object"
					},
					"Translation":
					{
						"Text": "世界上下文对象"
					},
					"Key": "GetEventListenerCount_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "World context object"
					},
					"Translation":
					{
						"Text": "世界上下文对象"
					},
					"Key": "HasEvent_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "World context object"
					},
					"Translation":
					{
						"Text": "世界上下文对象"
					},
					"Key": "UnpinEvent_Self_Tooltip"
				},
				{
					"Source":
					{
						"Text": "event game system"
					},
					"Translation":
					{
						"Text": " 事件 游戏 系统"
					},
					"Key": "GameEventBase_Keywords"
				},
				{
					"Source":
					{
						"Text": "remove all listeners receiver cleanup clear unbind unsubscribe event game system"
					},
					"Translation":
					{
						"Text": "移除 全部 所有 监听 接收者 清理 清除 解绑 取消订阅 事件 游戏 系统"
					},
					"Key": "RemoveAllListeners_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} addevent add listener addlistener bind subscribe register hook attach"
					},
					"Translation":
					{
						"Text": "{0} 添加 监听 绑定 订阅 注册 挂接"
					},
					"Key": "AddListener_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} get event listener count geteventlistenercount number amount size num"
					},
					"Translation":
					{
						"Text": "{0} 获取 事件 监听器 数量 计数 个数"
					},
					"Key": "GetEventListenerCount_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} has event hasevent check exist contains valid"
					},
					"Translation":
					{
						"Text": "{0} 检查 存在 包含 有效 是否"
					},
					"Key": "HasEvent_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} removeevent remove listener removelistener unbind unsubscribe unregister detach"
					},
					"Translation":
					{
						"Text": "{0} 移除 删除 解绑 取消订阅 分离"
					},
					"Key": "RemoveListener_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} send event sendevent trigger fire emit dispatch broadcast"
					},
					"Translation":
					{
						"Text": "{0} 发送 触发 派发 广播 事件"
					},
					"Key": "SendEvent_Keywords"
				},
				{
					"Source":
					{
						"Text": "{0} unpin event unpinevent clear reset release unlock"
					},
					"Translation":
					{
						"Text": "{0} 取消固定 清除 重置 释放 解锁"
					},
					"Key": "UnpinEvent_Keywords"
				}
			]
		},
		{
			"Namespace": "UK2Node_GetEventListenerCount",
			"Children": [
				{
					"Source":
					{
						"Text": "GetEventListenerCount function not found"
					},
					"Translation":
					{
						"Text": "未找到GetEventListenerCount函数"
					},
					"Key": "GetEventListenerCountFunctionNotFound"
				}
			]
		},
		{
			"Namespace": "UK2Node_HasEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "HasEvent function not found"
					},
					"Translation":
					{
						"Text": "未找到HasEvent函数"
					},
					"Key": "HasEventFunctionNotFound"
				}
			]
		},
		{
			"Namespace": "UK2Node_RemoveAllListenersForReceiver",
			"Children": [
				{
					"Source":
					{
						"Text": "RemoveAllListenersForReceiver function not found"
					},
					"Translation":
					{
						"Text": "未找到RemoveAllListenersForReceiver函数"
					},
					"Key": "RemoveAllListenersForReceiverFunctionNotFound"
				}
			]
		},
		{
			"Namespace": "UK2Node_SendEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "Invalid parameters! @@"
					},
					"Translation":
					{
						"Text": "无效参数！@@"
					},
					"Key": "ParamDataValid"
				},
				{
					"Source":
					{
						"Text": "Invalid pins in @@"
					},
					"Translation":
					{
						"Text": "@@中的引脚无效"
					},
					"Key": "InvalidPins"
				},
				{
					"Source":
					{
						"Text": "Type mismatch, please refresh the node! @@"
					},
					"Translation":
					{
						"Text": "类型不匹配，请刷新节点！@@"
					},
					"Key": "ParamDataMatch"
				}
			]
		},
		{
			"Namespace": "UK2Node_UnpinEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "UnpinEvent function not found"
					},
					"Translation":
					{
						"Text": "未找到UnpinEvent函数"
					},
					"Key": "UnpinEventFunctionNotFound"
				}
			]
		}
	]
}